cases/old/pipe-fsi-mix/fluid/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// Collect the internal faces at x=1.0 into a faceZone for createBaffles.

actions
(
    {
        name    membraneZone;
        type    faceZoneSet;
        action  new;
        source  planeToFaceZone;
        point   (1.0 0.2 0.005);
        normal  (1 0 0);
    }
);
